Repository: RudMike/RmEncrypter_PublicVersion
Catalog: RmEncrypter_PublicVersion/Resources/Localize/MessagesLocalize.*.resx
Languages: ru

# AccountDeleteConfirm
source: The account will be permanently deleted. All files used by the account will remain on the device in encrypted form. If you have transferred the deleting account to another device, these files can be decrypted on that device. After deleting the account, you can register a new one with the same name, or restore it from the recovery file if it was created. Continue?
ru: Аккаунт будет безвозвратно удален. Все файлы, используемые аккаунтом, останутся на устройстве в зашифрованном виде. Если Вы перенесли удаляемый аккаунт на другое устройство, то эти файлы могут быть расшифрованы на нем. После удаления аккаунта Вы сможете зарегистрировать новый с тем же именем, или восстановить его из файла восстановления, если он был создан. Продолжить?

# AccountDeleted
source: The account has been successfully deleted.
ru: Аккаунт успешно удален.

# AccountDeleteMessage
source: Your account will be completely deleted from this device. Continue?
ru: Ваш аккаунт будет полностью удален с этого устройства. Продолжить?

# AccountTransferMessage
source: A file containing your account data will be created. This will allow you to transfer your account to another device. Continue?
ru: Будет создан файл, содержащий данные учетной записи. С его помощью Вы сможете перенести Ваш аккаунт на другое устройство. Продолжить?

source: Are you sure?
ru: Вы уверены?

source: Confirm
ru: Подтвердить

# ConfirmDelete
source: Do you really want to delete this record?
ru: Вы действительно хотите удалить эту запись?

# DataDoesntMatch
source: The data doesn't match.
ru: Данные не совпадают.

source: Delete
ru: Удаление

# EnterNewAuthData
source: You need to enter new authorization data or delete the existing account from the device.
ru: Вам необходимо ввести новые данные для авторизации или удалить существующую учетную запись с устройства.

source: Error
ru: Ошибка

# ErrorAuthDataObfuscation
source: The file structure is broken. The user data cannot be retrieved. Make sure that the file was generated by this program and no changes were made to it.
ru: Структура файла нарушена. Данные пользователя не могут быть получены. Убедитесь, что файл был сформирован этой программой и в него не вносились изменения.

# ErrorEmptyPassword
source: The password can't be empty.
ru: Пароль не может быть пустым.

# ErrorEmptySite
source: The site name can't be empty.
ru: Имя сайта не может быть пустым.

# ErrorEmptyUsername
source: The username can't be empty.
ru: Имя пользователя не может быть пустым.

# ErrorFileContent
source: The file is corrupt and can't be read. A third party or a third-party program may have been made changes.
ru: Файл поврежден и не может быть прочитан. Возможно, были внесены изменения сторонним лицом или сторонней программой.

# ErrorFileNotExist
source: The file was not found.
ru: Данный файл не найден.

# ErrorKey
source: This file can't be opened by current user.
ru: Этот файл не может быть открыт текущим пользователем.

# ErrorLengthUsername
source: The length of the username can't be less than 5 or more than 20 symbols.
ru: Длина имени пользователя не может быть менее 5 или более 20 символов.

# ErrorOpenInBrowser
source: Can't open the site. Try to go to it manually.
ru: Не удается открыть сайт. Попробуйте перейти на него вручную.

# ExceptionKeyExist
source: For this user a key already exist. Just login.
ru: Для этого пользователя ключ уже существует. Просто войдите.

# ExceptionKeyNotFound
source: A key with this ID is not found in the database.
ru: Ключ с этим ID в базе данных не найден.

# ExceptionLengthPassword
source: The password must be at least 6 characters long.
ru: Длина пароля должна быть не менее 6 символов.

# ExceptionUserExist
source: The user with same name already exist.
ru: Пользователь с этим именем уже существует.

# ExceptionUserNotExist
source: The user with this name is not exist.
ru: Пользователь с этим именем не существует.

# FileCreated
source: The file has created successfully.
ru: Файл успешно создан.

# FileName
source: The file name:
ru: Имя файла:

# IncorrectPassword
source: The password is incorrect. Check your username and password. It is case sensitive.
ru: Неверный пароль. Проверьте имя пользователя и пароль. Они чувствительны к регистру.

source: Information
ru: Информация

# KeyNotExist
source: There is no key in the database for this user.
ru: В базе данных отсутствует ключ для этого пользователя.

# KeyReady
source: Your key is ready. Press the button to go the main page.
ru: Ваш ключ готов. Нажмите кнопку для перехода на главную страницу.

# LoggedAlready
source: There is an active user. Log out from the account to log in again.
ru: Имеется активный пользователь. Выйдите из аккаунта чтобы войти снова.

source: Logout
ru: Выход из аккаунта

# LogoutMessage
source: Are you sure you want to logout?
ru: Вы уверены, что хотите выйти из аккаунта?

# NewKeyGenerationMessage
source: A new key will be generated for the account. You will be able to specify files encrypted with the old key, which must be encrypted with the new key. Opening the files, which were not specified in the previous step, will be impossible. The current window will be close, so save the changes in the files. The operation will take a long time. Continue?
ru: Для учетной записи будет сгенерирован новый ключ. Вы сможете указать файлы, зашифрованные старым ключом, которые должны быть зашифрованы новым ключом. Открытие файлов, не указанных на предыдущем этапе, станет невозможным. Текущее окно будет закрыто, поэтому сохраните изменения в файлах. Операция займет длительное время. Продолжить?

source: New record
ru: Новая запись

# OpenNewFileMessage
source: Changes in current file will not been saved. Open another one?
ru: Изменения в текущем файле не будут сохранены. Открыть другой?

# PasswordNotMatchCurrent
source: Inputted password doesn't match with the password of the current account.
ru: Введенный пароль не соответствует паролю текущей учетной записи.

# PasswordsDontMatch
source: The passwords don't match.
ru: Пароли не совпадают.

# PasswordsOldNewEquals
source: The new password equals the old one.
ru: Новый пароль совпадает со старым.

# PasswordWasChanged
source: The password was succesfully changed.
ru: Пароль был успешно изменен.

# ProgramCloseMessage
source: Are you sure you want to close the program?
ru: Вы уверены, что хотите выйти из программы?

# RecoverySuccess
source: Account recovery completed successfully.
ru: Восстановление учетной записи завершено успешно.

# RedirectToAuthorization
source: You will be redirected to the authorization page.
ru: Вы будете перенаправлены на страницу авторизации.

# RedirectToKeyRegistration
source: You will be redirected to the key registration page.
ru: Вы будете перенаправлены на страницу регистрации ключа.

# RedirectToSelectFiles
source: You will be redirected to the select files page.
ru: Вы будете перенаправлены на страницу выбора файлов.

# RepeatedPasswordDoesntMatch
source: The repeated password doesn't match.
ru: Повторно введенный пароль не совпадает.

# SameOrNoneUsernames
source: The database contains some records with this user name or none.
ru: База данных содержит несколько записей с этим именем пользователя или не содержит ни одной.

# SameUsernames
source: The database contains some records with this user name.
ru: База данных содержит несколько записей с этим именем пользователя.

source: Save changes?
ru: Сохранить изменения?

# SaveFileMessage
source: Save file changes? The file will be encrypted and rewritten. The operation can take a long time.
ru: Сохранить изменения в файле? Файл будет зашифрован и перезаписан. Операция может занять длительное время.

# SaveSuccess
source: Save completed successfully.
ru: Сохранение завершено успешно.

source: Show/edit record
ru: Просмотр/редактирование записи

source: Success
ru: Успешно

# UnhandledExceptionNotify
source: An unhandled exception has occurred, the program will be closed. Contact the developer and report it.
ru: Возникло необработанное исключение, программа будет закрыта. Свяжитесь с разработчиком и сообщите об этом.

# UpdateKeyCompleted
source: The process is completed successfully.
ru: Процесс успешно завершен.

# UpdateKeyStage1
source: I'm decrypting files.
ru: Расшифровываю файлы.

# UpdateKeyStage2
source: I'm updating the key in the database.
ru: Обновляю ключ в базе данных.

# UpdateKeyStage3
source: I'm encrypting files with the new key.
ru: Шифрую файлы новым ключом.

# UserNotExist
source: A user with this username is not found in the database.
ru: Пользователь с этим именем в базе данных не найден.

source: Warning
ru: Внимание

# WrongKey
source: Wrong encryption key.
ru: Неверный ключ шифрования.
